In [30]:
# This notebook may contain examples from the Learning SQL book by Alan Beaulieu, as this is a summary of my 
# readings in my words.

In [1]:
%load_ext sql

In [2]:
%sql mysql://root:2018DataJobs!@localhost/Learning

/anaconda3/lib/python3.5/site-packages/sqlalchemy/engine/default.py:508: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  cursor.execute(statement, parameters)

'Connected: root@Learning'

In [3]:
%sql USE Learning

 * mysql://root:***@localhost/Learning
0 rows affected.

[]

**CREATE TABLE**

In [4]:
%%sql
CREATE TABLE fishies(
person_id SMALLINT UNSIGNED,
fname VARCHAR(20),
lname VARCHAR(20)
);

 * mysql://root:***@localhost/Learning
0 rows affected.

[]

In [5]:
%sql DESC fishies

 * mysql://root:***@localhost/Learning
3 rows affected.

[('person_id', 'smallint(5) unsigned', 'YES', '', None, ''),
 ('fname', 'varchar(20)', 'YES', '', None, ''),
 ('lname', 'varchar(20)', 'YES', '', None, '')]

**ADD COLUMNS**

In [6]:
%%sql
ALTER TABLE fishies 
ADD COLUMN gender CHAR(1) CHECK (gender IN ('M','F')) AFTER lname,
ADD COLUMN birth_date DATE,
ADD COLUMN street VARCHAR(30),
ADD COLUMN city   VARCHAR(20),
ADD COLUMN state VARCHAR(20),
ADD COLUMN country VARCHAR(20),
ADD COLUMN postal_code VARCHAR(20);

 * mysql://root:***@localhost/Learning
0 rows affected.

[]

In [7]:
%sql DESC fishies

 * mysql://root:***@localhost/Learning
10 rows affected.

[('person_id', 'smallint(5) unsigned', 'YES', '', None, ''),
 ('fname', 'varchar(20)', 'YES', '', None, ''),
 ('lname', 'varchar(20)', 'YES', '', None, ''),
 ('gender', 'char(1)', 'YES', '', None, ''),
 ('birth_date', 'date', 'YES', '', None, ''),
 ('street', 'varchar(30)', 'YES', '', None, ''),
 ('city', 'varchar(20)', 'YES', '', None, ''),
 ('state', 'varchar(20)', 'YES', '', None, ''),
 ('country', 'varchar(20)', 'YES', '', None, ''),
 ('postal_code', 'varchar(20)', 'YES', '', None, '')]

**DROP TABLE**

In [17]:
# >>>  %sql DROP TABLE fishies

**ADD - MODIFY - UPDATE ROWS**

Auto Incrementing ID Numbers

In [10]:
%%sql
ALTER TABLE fishies MODIFY person_id SMALLINT UNSIGNED AUTO_INCREMENT;

 * mysql://root:***@localhost/Learning
(_mysql_exceptions.OperationalError) (1075, 'Incorrect table definition; there can be only one auto column and it must be defined as a key') [SQL: 'ALTER TABLE fishies MODIFY person_id SMALLINT UNSIGNED AUTO_INCREMENT;'] (Background on this error at: http://sqlalche.me/e/e3q8)

So we have to first assign it as PRIMARY KEY

In [12]:
%%sql
ALTER TABLE fishies ADD PRIMARY KEY (person_id)

 * mysql://root:***@localhost/Learning
0 rows affected.

[]

In [13]:
%sql DESC fishies

 * mysql://root:***@localhost/Learning
10 rows affected.

[('person_id', 'smallint(5) unsigned', 'NO', 'PRI', None, ''),
 ('fname', 'varchar(20)', 'YES', '', None, ''),
 ('lname', 'varchar(20)', 'YES', '', None, ''),
 ('gender', 'char(1)', 'YES', '', None, ''),
 ('birth_date', 'date', 'YES', '', None, ''),
 ('street', 'varchar(30)', 'YES', '', None, ''),
 ('city', 'varchar(20)', 'YES', '', None, ''),
 ('state', 'varchar(20)', 'YES', '', None, ''),
 ('country', 'varchar(20)', 'YES', '', None, ''),
 ('postal_code', 'varchar(20)', 'YES', '', None, '')]

___

So we had to first `ALTER`  `person_id` to be the `PK` then `MODIFY` it for the `auto increment`

In [14]:
%%sql
ALTER TABLE fishies MODIFY person_id SMALLINT UNSIGNED AUTO_INCREMENT;

 * mysql://root:***@localhost/Learning
0 rows affected.

[]

In [18]:
%sql DESC fishies

 * mysql://root:***@localhost/Learning
10 rows affected.

[('person_id', 'smallint(5) unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('fname', 'varchar(20)', 'YES', '', None, ''),
 ('lname', 'varchar(20)', 'YES', '', None, ''),
 ('gender', 'char(1)', 'YES', '', None, ''),
 ('birth_date', 'date', 'YES', '', None, ''),
 ('street', 'varchar(30)', 'YES', '', None, ''),
 ('city', 'varchar(20)', 'YES', '', None, ''),
 ('state', 'varchar(20)', 'YES', '', None, ''),
 ('country', 'varchar(20)', 'YES', '', None, ''),
 ('postal_code', 'varchar(20)', 'YES', '', None, '')]

Here the INSERT statement is used to add rows to the table. Components of the INSERT statement:
- Name of the TABLE 
- Names of the columns in that table to be populated
- The values to be inserted

In [19]:
%%sql
INSERT INTO fishies (person_id, fname, lname, gender, birth_date)
VALUES (null, 'William', 'Briant', 'M', '1980-08-19');

 * mysql://root:***@localhost/Learning
1 rows affected.

[]

Please not that `person_id` will be assinged automatically by the MySQL server

In [21]:
%sql SELECT * FROM fishies;

 * mysql://root:***@localhost/Learning
1 rows affected.

[(1, 'William', 'Briant', 'M', datetime.date(1980, 8, 19), None, None, None, None, None)]

Let's add multiple rows at once

In [23]:
%%sql
INSERT INTO fishies (person_id, fname, lname, gender, birth_date, street, city, state, country, postal_code)
VALUES(null, 'Dwyne', 'Smith', 'M', '1980-08-20', '1320 Sokak St.','Fairfax','VA', 'USA','20222'),
    (null, 'Katelyn', 'Jackson', 'F', '1980-08-21', '1320 Pennstate St.','Fairfax','VA', 'USA','20262'),
    (null, 'Dwyne', 'Smith', 'M', '1980-08-20', '1320 Sokak St.','Arlington','VA', 'USA','20522')

 * mysql://root:***@localhost/Learning
3 rows affected.

[]

In [24]:
%sql SELECT * FROM fishies;

 * mysql://root:***@localhost/Learning
4 rows affected.

[(1, 'William', 'Briant', 'M', datetime.date(1980, 8, 19), None, None, None, None, None),
 (2, 'Dwyne', 'Smith', 'M', datetime.date(1980, 8, 20), '1320 Sokak St.', 'Fairfax', 'VA', 'USA', '20222'),
 (3, 'Katelyn', 'Jackson', 'F', datetime.date(1980, 8, 21), '1320 Pennstate St.', 'Fairfax', 'VA', 'USA', '20262'),
 (4, 'Dwyne', 'Smith', 'M', datetime.date(1980, 8, 20), '1320 Sokak St.', 'Arlington', 'VA', 'USA', '20522')]

Oooopppsss! Last row has the wrong information....Let's `UPDATE` it

In [25]:
%%sql
UPDATE fishies
SET fname = 'Elizabeth',
    lname = 'Thompson',
    gender = 'F',
    birth_date = '1980-08-22',
    street = '8990 Woodlake St.',
    city = 'Hampton',
    postal_code = '23456'
WHERE person_id = 4;

 * mysql://root:***@localhost/Learning
1 rows affected.

[]

In [26]:
%sql SELECT * FROM fishies;

 * mysql://root:***@localhost/Learning
4 rows affected.

[(1, 'William', 'Briant', 'M', datetime.date(1980, 8, 19), None, None, None, None, None),
 (2, 'Dwyne', 'Smith', 'M', datetime.date(1980, 8, 20), '1320 Sokak St.', 'Fairfax', 'VA', 'USA', '20222'),
 (3, 'Katelyn', 'Jackson', 'F', datetime.date(1980, 8, 21), '1320 Pennstate St.', 'Fairfax', 'VA', 'USA', '20262'),
 (4, 'Elizabeth', 'Thompson', 'F', datetime.date(1980, 8, 22), '8990 Woodlake St.', 'Hampton', 'VA', 'USA', '23456')]

**DELETE ROW**

In [28]:
%%sql
DELETE FROM fishies
WHERE person_id = 1;

 * mysql://root:***@localhost/Learning
1 rows affected.

[]

In [29]:
%sql SELECT * FROM fishies;

 * mysql://root:***@localhost/Learning
3 rows affected.

[(2, 'Dwyne', 'Smith', 'M', datetime.date(1980, 8, 20), '1320 Sokak St.', 'Fairfax', 'VA', 'USA', '20222'),
 (3, 'Katelyn', 'Jackson', 'F', datetime.date(1980, 8, 21), '1320 Pennstate St.', 'Fairfax', 'VA', 'USA', '20262'),
 (4, 'Elizabeth', 'Thompson', 'F', datetime.date(1980, 8, 22), '8990 Woodlake St.', 'Hampton', 'VA', 'USA', '23456')]